{
  "multiplicities": "",
  "polytopes": "The purpose of this site is to give an introduction to toric varieties -- and to develop geometric intuition through an interactive 2D-polytope interface.\n\n[[ex-poly-1|Click here]] to load a polytope, and click the lattice points to modify the given polytope.\n\nA $\\textit{polytope}$, $\\Pi \\subset \\mathbb{R}^n$ is the convex hull of finitely many points.\n\nEquivalently, a polytope is the intersection of finitely many half planes.\n\nWe restrict our attention to the convex hulls of lattice points $$\\Lambda \\subset \\RR^2$$also known as $\\textit{lattice polytopes}$. Equivalently, lattice polytopes are intersections of half-planes by forms in the dual lattice:$$\\Lambda^\\vee \\subset {(\\mathbb{R}^2)}^\\vee.$$\n\nTo a polytope $\\Pi\\subset \\mathbb{R}^n$ we associate a partially ordered set of $\\textit{strata}$: $$\\Sigma(\\Pi) \\subset \\mathcal{P}(\\Pi).$$Visibly, a stratum is either $\\Pi$ or a polytope on the boundary of $\\Pi$ (in our example, a vertex, edge or face). (Technically a stratum is a polytope which is the convex hull of a subset of extremal vertices.) The example in the lattice has\n\n[center]({{1 + vertices + edges + faces}} {{\"total strata\"}}) = ({{faces|descr}})+({{edges|descr}})+({{vertices|descr}})+({{\"1 empty stratum\"}}).[/center]",
  "rings": "Consider the triangle [[P2:rings]]. This is the simplest 2D polytope and corresponds to the projective plane.\n\n$\\textbf{The ring associated to a stratum}.$\n\nTo understand the coordinate rings of these polytopes, click on a vertex. The cone around this vertex defines a sub-monoid of the lattice (after translating the vertex to the origin): $$M \\subset \\Lambda.$$Working over a field $k$ we associate to $M$ the $\\textit{monoid ring}$: $$k[M] = \\left\\{\\sum a_i \\chi^{m_i} \\middle| m_i \\in M, a_i \\in k\\right\\}$$where elements are polynomials in $\\chi^m$ for an element $m \\in M$ and multiplication is defined by associativity and exponentiation rules.\n\nNow to each vertex we have an associated ring, and by taking the spectrum of this ring we have an affine variety.\n"
}